let charachterName = localStorage.getItem('gameName');


const intro = {
    0 : `في المستقبل, فيه حاجه اسمهها الواقع الإفتراضي اتشهر في العالم وبقي معظم العالم بيستخدمه وبيحبه عشان يتعلم ويعيش تجربة جديدة فيه. الواقع الإفتراضي ده عبارة عن عالم إلكتروني مصنوع بتعيش جواه ولا كأنك عايش فيه بظبت و تعرف تتحرك وتلمس وتتكلم مع اي حد و هو هيكون منتبه ليك. و ده تطور كبير حصل في العالم    `,
    1 : `كان فيه ولد اسمه زين. ده شاب شاطر و مبدع و بيحب الخير للناس وعايز يقدم المساعدة علي قد ما يقدر وكان في اكادمية من اكادميات العالم الإفتراضي
    `,
    2 : `ويوم من الأيام جت له فكرة انه يخترع العالم الخاص بيه بهدف انه يعلم الناس اكتر عن الثقافة الرقمية 
    `,
    3 : `بعد كمية كبيرة من الجهد و التعب و التفكير عرف زين يخلص العالم الخاص بيه و طبعا هو بيحب يكون مختلف فضاف ميزة جديدة في العالم الخاص بيه وان هو يخترع صاحب للمستخدم يكون معاه من اول الرحلة لحد ما يتعلم كل حاجه ممكنة عن الثقافة الرقمية و الصاحب ده إسمه "إكس".
    `,
    4 : `والعالم إنتشر في العالم وكل الناس بدأت تجربه وانت دلوقتي يباشا هتدخل انت كمان العالم الخاص بزين وهو تعب جدا في اختراعه فمحتاجين منك تركز علي انك تاخد كل المعلومات الممكنة. يلا بينا يا ${charachterName}
    `,
    5 : `اول ما  دخل ${charachterName} العالم. شاف مكان واسع اوي ومليان بالإلكترونيات و الروبوتات و الناس بس الروبوتات كانت اكتر . مكنش فيه حد قاعد لوحده كل الناس كانت قاعدة مع بعض فالعالم كان مليان بالبهجة و الفرحة كدة و ${charachterName} عمال بيشوف تجارب كتير هيعملها و كل مجموعة من الناس بتعمل حاجه معينة فبدء يجيلوا حبة تعقيد من كتر الدروس الموجودة عن الثقافة الرقمية بس مرة واحدة ظهر له روبوت وبدء مبينهم كلام
    `,
}
const xAndCharachter = {
    0 : {
        c : `إكس`,
        p : `أهلا يا ${charachterName}, عامل ايه`
    },
    1 : {
        c : `${charachterName}`,
        p : `أهلا, مين انت؟`
    },
    2 : {
        c : `إكس`,
        p : `انا إكس صاحبك في الرحلة دي كلها ودايما جمبك في اي حاجه وبساعدك عشان تتعلم كل جديد.`,
    },
    3 : {
        c : `${charachterName}`,
        p : `أهلا يا إكس سمعت عنك قبل ما ادخل انا بقول برضوا انت عرفت إسمي ازاي كدة. انا بدأت اقلق الصراحه من كتر الدروس يا إكس وعايز ارجع للعالم `
    },
    4 : {
        c : `إكس`,
        p : ` مينفعش تقول كدة خلاص انت بدأت تجربة ولازم تكملها. بص كل الناس في الأول كانوا زيك كدة وده بسبب انهم مش متعودين علي العالم بس الموضوع بسيط بص حتي دلوقتي كل الناس ال حواليك فرحانين ازاي عشان صبروا بس فأصبر انت كمان و هتحب المكان ده جدًا. انت جي بهدف معين؟
        `
    },
    5 : {
        c : `${charachterName}`,
        p : `شكرا ليك يا إكس, انا جي عشان عايز اتعلم اكتر معلومات ممكنة عن الثقافة الرقمية واطلع من العالم ده وانا فاهم كل حاجه`
    },
    6 : {
        c : `إكس`,
        p : ` حلو جدًا قبل اي حاجه لازم تكون محدد هدف وانت عديت الخطوة دي بحييك يبني والله. يلا بينا انا معاك في كل خطوة واول خطوة عندنا هي انك تعرف طرق الإتصال بالإنترنت. 
        `
    },
    7 : {
        c : `${charachterName}`,
        p : `هعرفها ازاي دي؟`
    },
    8 : {
        c : `إكس`,
        p : ` هما خمس طرق هنتعلمهم وفيه حبة ناس اهم واقفين قدام كشك إلكتروني كل واحد من دول بيستخدم وعنده خبرة في طريقة من الطرق روح اتعرف عليهم وخد منهم خبرات.   `
    },
    9 : {
        c : `${charachterName}`,
        p : `تمام يلا بينا`
    },
}
const ahmedAndCharachter = {
    0 : {
        c : ``,
        p : `اول شخص شافه ${charachterName} هو شاب اسمه أحمد كان بيشتري تليفون من التجارة الإلكترونية ولاحظ إن ${charachterName} محتار وعايز يتكلم معاه بس مش عارف فسأله        `
    }, 
    1 : {
        c : `أحمد`,
        p : ` اهلا, شكلك تايه هنا ولسة جديد صح
        `
    }, 
    2 : {
        c : `${charachterName}`,
        p : `اه فعلا`
    }, 
    3 : {
        c : `أحمد`,
        p : `مش مشكلة عادي كلنا هنا واحد انت اسمك ايه؟`
    }, 
    4 : {
        c : `${charachterName}`,
        p : `إسمي ${charachterName}, وانت؟`
    }, 
    5 : {
        c : `احمد`,
        p : `أحمد, عاشت الأسامي يا ${charachterName}, اسمي أحمد. اقدر اساعدك بحاجه ؟`
    }, 
    6 : {
        c : `${charachterName}`,
        p : `انا شوفتك بتشتري منتج من التجارة الإلكترونية و مستعمل الإنترنت من غير اي سلك او حتي خط فازاي ده؟`
    }, 
    7 : {
        c : `احمد`,
        p : `انا مشغل الواي فاي و بستعمله في التجارة الإلكترونية`
    }, 
    8 : {
        c : `${charachterName}`,
        p : `ايه الواي فاي ده؟`
    }, 
    9 : {
        c : `احمد`,
        p : `إكس: هو تقنية لاسلكية تسمح بنقل البيانات من الأجهزة المختلفة للإتصال بالإنترنت ولنقل الملفات بين الأجهزة و تستخدم العديد من الأجهزة المحمولة تقنية الاتصال بالإنترنت والتواصل فيما بينهما عن طريق الواي فاي.         `
    }, 
    10 : {
        c : `${charachterName}`,
        p : `يعني ايه لاسلكيًا؟`
    }, 
    11 : {
        c : `احمد`,
        p : `زي ما انت سألتني ازاي مشغل نت من غير سلك`
    }, 
    12 : {
        c : `${charachterName}`,
        p : `لاسلكيًا يعني من غير سلك قصدك ؟`
    }, 
    13 : {
        c : `احمد`,
        p : `مظبوط`
    }, 
    14 : {
        c : `${charachterName}`,
        p : `وايه العملية البتدور عشان الواي فاي يشغل إنترنت`
    }
}
const xAndCharachterWithCharchter = {
    0 : {
        c : `إكس`,
        p : "نقل البيانات من الأجهزة المختلفة لللإتصال بالإنترنت"
    }, 
    1 : {
        c : `${charachterName}`,
        p : "ايه هي أهمية الواي فاي؟"
    }, 
    2 : {
        c : `إكس`,
        p : "إتصال بالإنترنت ونقل الملفات"
    }, 
    3 : {
        c : `${charachterName}`,
        p : "هل فيه نوع أجهزة مشهور بالخاصية دي."
    }, 
    4 : {
        c : `إكس`,
        p : "ايوة فالعديد من الأجهزة المحمولة تستخدم تقنية الاتصال باللإنترنت بالواي فاي"
    }, 
    5 : {
        c : `${charachterName}`,
        p : "تمام شكرًا يا أحمد ويا إكس "
    }, 
    6 : {
        c : `إكس`,
        p : "ايه رأيك بقي"
    }, 
    7 : {
        c : `${charachterName}`,
        p : "لا تجربة جميلة و اتمني كل التجارب تكون حلوة كدة او احلي كمان"
    }, 
    8 : {
        c : `إكس`,
        p : "إنشاء الله بص بقي كدة دور علي شخص تاني في المكان ده واتكلم معا"
    }, 
    9 : {
        c : `${charachterName}`,
        p : "تمام"
    }, 
}
const saraAndCharachter = {
    0 : {
        c : ``,
        p : `كان فيه بنت برضوا قاعدة علي التليفون بس المرة دي كانت بتتعلم من النت فراح اتشجع ${charachterName} و كلمها.        `
    } , 
    1 : {
        c : `${charachterName}`,
        p : `إزيك, انا اسمي ${charachterName} ممكن اعرف اسم حضرتك`   
    } , 
    2 : {
        c : `سارة`,
        p : `اهلا يا ${charachterName}, انا اسمي سارة. اقدر اساعدك ازاي؟`   
    } , 
    3 : {
        c : `${charachterName}`,
        p : ` اهلا يا سارة, انا جي هنا اتعلم عن طرق الإتصال بالإنترنت و لقيتك بتتعلمي من علي النت هو ده واي فاي صح؟`   
    } , 
    4 : {
        c : `سارة`,
        p : ` لا يا ${charachterName}, ده اسمه طلب هاتفي.`   
    } , 
    5 : {
        c : `${charachterName}`,
        p : `ايه طلب هاتفي ده؟`   
    } , 
    6 : {
        c : `سارة`,
        p : `ده نوع من انواع الإتصال بالإنترنت بس عن طريق الخط ؟`   
    } , 
    7 : {
        c : `${charachterName}`,
        p : `طب حلو جدا ده.`   
    } , 
    8 : {
        c : `سارة`,
        p : `للأسف لا الطلب الهاتفي يجب تجنبه لو لم يكن الخدمة الوحيدة الموجودة في المنطق`   
    } , 
    9 : {
        c : `${charachterName}`,
        p : `ده ليه ده؟`   
    } , 
    10 : {
        c : `سارة`,
        p : `عشان الطلب الهاتفي يستخدم خط الهاتف بس و لو عندك خط واحد بس مش هتعرف تستخدم خاصية الإنترنت و الإتصال في نفس الوقت مش هينفع تشغل الخاصيتين مع بعض.`   
    } , 
    11 : {
        c : `${charachterName}`,
        p : `يعني كدة هكون بتكلم في التليفون و مش هعرف افتح إنترنت ؟ `   
    } , 
    12 : {
        c : `سارة`,
        p : `ايوة`   
    } , 
    13 : {
        c : `${charachterName}`,
        p : `فعشان كدة لما كنت ببقي بكلم صاحبي ويقولي بعتلك حاجه مكنتش بتتبعت لما بفتح النت مش الواي فاي. `   
    } , 
    14 : {
        c : `سارة`,
        p : `ايوة بتحصل معايا برضوا وحصلت معانا كلنا وانا دلوقتي لو حد رن عليا الإنترنت هيفصل ومش هعرف اكمل تعليم.`   
    } , 
    15 : {
        c : `${charachterName}`,
        p : `طيب اسيبك تكملي تعليم شكرًا لوقتك.`   
    }
}
const xAndCharachterWithSara = {
    0 : {
        c : `إكس`,
        p : `شوفت بقي ان مش حلو اوي خاصية الطلب الهاتفي دي`
    },
    1 : {
        c : `${charachterName}`,
        p : `ايوة بس كد مفيش اي معلومة تانية عنها؟`,
    } , 
    2 : {
        c : `إكس`,
        p : `لا هو بس خليك عارف ان اسمها بالإنجليزي (Dial Up)`,
    } , 
    3 : {
        c : `${charachterName}`,
        p : `احفظها ازاي بقي دي.`,
    } , 
    4 : {
        c : `إكس`,
        p : `بص إفتكر كلمة UP بانك بترفع شاشة التليفون علي ودنك عشان تتكلم و Dial يعني اتصال.`,
    } , 
    5 : {
        c : `${charachterName}`,
        p : `تمام حلو اوي كدة بس ايه الحل الخاص بالمشكلة دي؟`,
    } , 
    6 : {
        c : `إكس`,
        p : `إكس: بص فيه خاصية اسمها DSL روح اسأل الشخص الواقف في حتة فيها شبكة ده هتلاقيه بيستخدمها.         `,
    } , 
    7 : {
        c : `${charachterName}`,
        p : `تمام يلا بينا`,
    }
}
const omarAndCharachter = {
    0 : {
        c : `${charachterName}`,
        p : `أهلا, ممكن اعرف اسم حضرتك ايه ؟`
    } ,
    1 : {
        c : `عمر`,
        p : `اهلا, انا اسمي عمر وانت ؟`
    } ,
    2 : {
        c : `${charachterName}`,
        p : `انا اسمي ${charachterName}. كنت عايز اعرف بتعمل ايه بظبت`
    } ,
    3 : {
        c : `عمر`,
        p : `وده ليه ده انشاء الله ؟`
    } ,
    4 : {
        c : `${charachterName}`,
        p : `لا لا اديني دقيقة اوضحلك كل حاجه . انا جي اتعلم طرق الإتصال بالإنترنت وسمعت انك بتستعمل DSL فعايز اعرف ايه ده؟.`
    } ,
    5 : {
        c : `عمر`,
        p : `بص يا ${charachterName} طبعًا اكيد انت عرفت خاصية الطلب الهاتفي صح ؟`
    } ,
    6 : {
        c : `${charachterName}`,
        p : `اه هي طرق من الإتصال بالإنترنت ونتجنبها لو هي مش الخدمة الوحيدة الموجودة عشان بتسخدم خاصية واحدة بس مش هتعرف تستخدم خاصية الإتصال والإنترنت في نفس الوقت. `
    } ,
    7 : {
        c : `عمر`,
        p : ` الله ينور عليييك. اييه الحلااوة دي `
    } ,
    8 : {
        c : `${charachterName}`,
        p : `حبيبي`
    } ,
    9 : {
        c : `عمر`,
        p : `انا كنت بستعمل الإنترنت في الخدمات المصرفية و كنت بدفع فاتورة كهرباء  بال DSL ال هي بقي هي عكس طلب الهاتفي بتعرف تستخدم الإنترنت و خط الهاتف في نفس الوقت وكمان هي أفضل وأسرع منها .`
    } ,
    10 : {
        c : `${charachterName}`,
        p : `ليه؟`
    } ,
    11 : {
        c : `عمر`,
        p : `عشان بتسخدم اتصال واسع نطاق بأسم "Broad Band".`
    } ,
    12 : {
        c : `${charachterName}`,
        p : `فده ال يخليها اسرع عشان بتسخدم اتصال واسع النطاق.`
    } ,
    13 : {
        c : `عمر`,
        p : `مظبوط هي كدة`
    } ,
    14 : {
        c : `${charachterName}`,
        p : `تمام شكرًا ليك.`
    } ,
}
const xAndCharachterWithOmar = {
    0 : {
        c : `${charachterName}`,
        p : `ايه مشوفتكش المرة دي دخلت معانا يعني.`
    },
    1 : {
        c : `إكس`,
        p : `معلش كنت بفكر فيها`
    },
    2 : {
        c : `${charachterName}`,
        p : `بتفكر في مين ؟؟؟`
    },
    3 : {
        c : `إكس`,
        p : `في مشاكلي يعم انت نيتك وحشة ليه كدة فيه ايه`
    },
    4 : {
        c : `${charachterName}`,
        p : `بحسب`
    },
    5 : {
        c : `إكس`,
        p : `بص بقي دلوقتي فيه بنت هناك اسمها هند روح كلمها عن طريقة جديدة`
    },
    6 : {
        c : `${charachterName}`,
        p : `واشمعنا اختارت دي يا إكس ؟`
    },
    7 : {
        c : `إكس`,
        p : "عشان هي عندها خبرة في مجال معين يعم مش الي في بالك لا"
    },
    8 : {
        c : `${charachterName}`,
        p : `طب وانا هقولها اني عرفت اسمها ازاي بقي؟`
    },
    9 : {
        c : `إكس`,
        p : `قولها انك جي من تبع إكس بس`
    },
    10 : {
        c : `${charachterName}`,
        p : ` متأكد من الكلام ده؟`
    },
    11 : {
        c : `إكس`,
        p : `عيب عليييك`
    },
    12 : {
        c : `${charachterName}`,
        p : `اما نشوف`
    },
}
const hendAndCharachter = {
    0 : {
        c : ``,
        p : `طبعا ${charachterName} كان متوتر وقلقان ان إكس عمال بيحور عليه و انه رايح يعمل مشكلة من اولها وبس شافها قاعدة فراح كلمها`
    },
    1 : {
        c : `${charachterName}`,
        p : `ازيك يا هند أيه الأخبار؟`
    },
    2 : {
        c : `هند`,
        p : `انت عرفت اسمي منين؟`
    },
    3 : {
        c : `${charachterName}`,
        p : `لا لا متقلقيش انا جي من طرف إكس.`
    },
    4 : {
        c : `هند`,
        p : `ايوة مين إكس ده يعني؟؟`
    },
    5 : {
        c : `${charachterName}`,
        p : `متعرفيش إكس ولا ايه`
    },
    6 : {
        c : `هند`,
        p : `عمري ما سمعت عنه`
    },
    7 : {
        c : `${charachterName}`,
        p : `لا لا انا بهزر معاكي بس انا توقعت اسمك يكون هند . انا اسمي ${charachterName}.`
    },
    8 : {
        c : `هند`,
        p : ` اهلا يا ${charachterName}, ممكن اساعدك ازاي.`
    },
    9 : {
        c : `${charachterName}`,
        p : `انا دلوقتي عرفت طرق إتصال بالإنترنت ال هما واي فاي, طلب هاتفي, DSL. فهل عندك طريقة كمان اتعلمها؟`  
    },
    10 : {
        c : `هند`,
        p : `بص انا عندي تجربة إتصال بالإنترنت بالأقمار الصناعية`
    },
    11 : {
        c : `${charachterName}`,
        p : `ايه الطريقة دي ممكن تقولي عنها اكتر؟`
    },
    12 : {
        c : `هند`,
        p : ` اكيد. انا في الأصل كنت من جزيرة صغيرة مفيهاش اي شبكة واي فاي او اتصال بالبيانات وكان شغلي محتاج اني انشيء بريد إلكتروني فكنت بستعمل إتصال بالأقمار الصناعية ال إسمها Satellite `
    },
    13 : {
        c : `${charachterName}`,
        p : `ايوة يعني اكتب ايه في الأمتحان برضوا ؟`
    },
    14 : {
        c : `هند`,
        p : ` هي اتصال ذات النطاق العريض يعني مساحتها واسعة و مبتطلبش وجود كابل او حتي خط هاتف لأنها بتتصل عبر الأقمار الصناعية التي تدور حول الأرض لاسلكيًا. `
    },
    15 : {
        c : `${charachterName}`,
        p : `فهمتك, ماشي كملي البريد الإلكتروني البتعمليه اسف اني عطلتك `
    },
    16 : {
        c : `هند`,
        p : `ولا يهمك `
    },
}
const xAndCharachterWithHend = {
    0 : {
        c : ``,
        p : `${charachterName} كان متجه لإكس كان بيقول لنفسه.`
    },
    1 : {
        c : `${charachterName}`,
        p : `يلهوي عليك يا إكس حطتني في موقف محرج من اول درس كدة امل هتعمل فيا ايه الوقت الجي ده ربنا يستر.`
    },
    2 : {
        c : `إكس`,
        p : `ايه عملت ايه`
    },
    3 : {
        c : `${charachterName}`,
        p : `سيبك من اني اتعلمت ايه هند قالت عليك أحلي كلام يبني`
    },
    4 : {
        c : `إكس`,
        p : `بجد؟`
    },
    5 : {
        c : `${charachterName}`,
        p : `اه انت ازاي محبوب اوي كدة و معروف في الحتة دي`
    },
    6 : {
        c : `إكس`,
        p : `يبني انا متعود كدة كدة ودي فطرة عندي`
    },
    7 : {
        c : `${charachterName}`,
        p : `مانا واخد بالي من الكلام ال اتقال عليك.`
    },
    8 : {
        c : `إكس`,
        p : `المهم عرفت طريقة ايه؟`
    },
    9 : {
        c : `${charachterName}`,
        p : `عرفت طريقة الأقمار الصناعية Satellite و عرفت  انها طريقة اتصال بالأنترنت ذات النطاق العريض ومبتتطلبش كابل او خط عشان بتتصل بالأقمار الي بتدور حولين الأرض لاسلكيًا.`
    },
    10 : {
        c : `إكس`,
        p : `براافوووا عليييك`
    },
    11 : {
        c : `إكس`,
        p : `دلوقتي بقي خلاص خلصنا اول حاجه`
    },
    12 : {
        c : `${charachterName}`,
        p : ` ازاي هو مش قولت انهم خمسة كدة احنا خدنا اربعة بس؟`
    },
    13 : {
        c : `إكس`,
        p : `اي ده اه صح. كنت بختبرك بس مش اكتر ونجحت في الأختبار`
    },
    14 : {
        c : `${charachterName}`,
        p : `ماشي ماشي فاضل ايه كمان كدة؟`
    },
    15 : {
        c : `إكس`,
        p : `اخر حاجه هي بسيطة جدا وهي ال 3 جي و 4 جي.`
    },
    16 : {
        c : `${charachterName}`,
        p : `ايه دول و هل كل واحد ليه تعريف معين؟`
    },
    17 : {
        c : `إكس`,
        p : `لا الاتنين نفس التعريف وهي الخدمة الأكثر شيوعًا و استخدامًا مع الهواتف وبيرتبط بيها الإنترنت لاسلكيًا من خلال شبكة مشغل الخدمة. `
    },
    18 : {
        c : `${charachterName}`,
        p : `يعني ايه اكثر جهاز بيستخدمها؟`
    },
    19 : {
        c : `إكس`,
        p : `الهواتف`
    },
    20 : {
        c : `${charachterName}`,
        p : `وبيرتبط لاسلكيًا برضوا بس من خلال ايه؟`
    },
    21 : {
        c : `إكس`,
        p : `شبكة مشغل الخدمة ال هي بتبقي جمب الواي فاي`
    },
    22 : {
        c : `${charachterName}`,
        p : `ايوة فهمت البيبقي عليها سهم طالع وسهم نازل دي.`
    },
    23 : {
        c : `إكس`,
        p : `ايوة بظبت`
    },
    24 : {
        c : `${charachterName}`,
        p : `يااه ايه السهولة دي وطب وانا سمعت عن 5 جي هي فين بقي؟`
    },
    25 : {
        c : `إكس`,
        p : `متجودش بقي هي مش موجودة في المنهج هو لحد 4 جي بس في الترم التاني عشان ال هيقول دلوقتي ان احنا خدناها في الترم الأول.`
    },
    26 : {
        c : `${charachterName}`,
        p : `اه صح خلينا في المعلومات الهتجيلنا في الإمتحان.`
    },
    27 : {
        c : `إكس`,
        p : `ايه رأيك في اول تجربة ودرس بقي . هتتعرف بعدين بقي علي طرق استخدام الإنترنت زي التعامل مع مختلف انواع البيانات والتواصل.`
    },
    28 : {
        c : `${charachterName}`,
        p : `طب يلا بينا؟`
    },
    29 : {
        c : `إكس`,
        p : `لا استني رايح فين لازم اختبرك الأول يحبيبي عشان اشوفك كنت مركز معايا زي ما قولتلك في الأول ولا لا`
    },
    30 : {
        c : `${charachterName}`,
        p : `يبني عيب عليك تعالي اثبتلك كمان.`
    },
    31 : {
        c : `إكس`,
        p : `ماشي يلا بينا بقي`
    },
}